[
    [
        {"tagName": "সব নামাজ", "dataType": "all"},
        {"tagName": "ফজরের নামায", "dataType": "fajr"},
        {"tagName": "যোহরের নামায", "dataType": "zuhr"},
        {"tagName": "আসররের নামায", "dataType": "asr"},
        {"tagName": "মাগরিবের নামায", "dataType": "magrib"},
        {"tagName": "এশার নামাযে", "dataType": "isha"}
    ],
    [
        {
            "title": "ফজরের নামায",
            "tag": "fajr",
            "contents": [
                {
                    "subtitle": "ফজরের দুই রাকাত সুন্নত নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِ الْفَجْرِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিল ফাজরে। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "ফজরের দুই রাকাত ফরজ নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِ الْفَجْرِ فَرْضُ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিল ফাজরে। ফারদুল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                }
            ]
        },
    
        
        {
            "title": "যোহরের নামায",
            "tag": "zuhr",
            "contents": [
                {
                    "subtitle": "যোহরের চার রাকাত সুন্নাত নামাযের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى اَرْبَعَ رَكْعَتِ صَلَوةِ الْظُهْرِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা আরবাআ রাক‘আতি সালাতিজ যোহরে। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "যোহরের চার রাকাত ফরজ নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى اَرْبَعَ رَكْعَتِ صَلَوةِ الْظُهْرِ فَرْضُ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা আরবাআ রাক‘আতি সালাতিজ যোহরে। ফারদুল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "যোহরের দুই রাকাত সুন্নাত নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِ الْظُهْرِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিজ যোহরে। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "যোহরের দুই রাকাত নফল নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِالْنَفْلِ مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিন নফলে। মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                }
            ]
        },
        {
            "title": "আসররের নামায",
            "tag": "asr",
            "contents": [
                {
                    "subtitle": "আসররের চার রাকাত সুন্নাত নামাযের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى اَرْبَعَ رَكْعَتِ صَلَوةِ الْعَصْرِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা আরবাআ রাক‘আতি সালাতিল আসরি। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "আসররের চার রাকাত ফরজ নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى اَرْبَعَ رَكْعَتِ صَلَوةِ الْعَصْرِ فَرْضُ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা আরবাআ রাক‘আতি সালাতিল আসরি। ফারদুল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                }
            ]
        },
        {
            "title": "মাগরিবের নামায",
            "tag": "magrib",
            "contents": [
                {
                    "subtitle": "মাগরিবের তিন রাকাত ফরজ নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى  ثَلَاثَ رَكْعَتِ صَلَوةِ المَغْرِبِ فَرْضُ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা সালাসা রাক‘আতি সালাতিল মাগরিব। ফারদুল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "মাগরিবের দুই রাকাত সুন্নাত নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِ المَغْرِبِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিল মাগরিব। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "মাগরিবের দুই রাকাত নফল নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِالْنَفْلِ مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিন নফলে। মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                }
            ]
        },
        {
            "title": "এশার নামায",
            "tag": "isha",
            "contents": [
                {
                    "subtitle": "এশার চার রাকাত সুন্নাত নামাযের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى اَرْبَعَ رَكْعَتِ صَلَوةِ العِشَاءِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা আরবাআ রাক‘আতি সালাতিল এশা। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "এশার চার রাকাত ফরজ নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى اَرْبَعَ رَكْعَتِ صَلَوةِ العِشَاءِ فَرْضُ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা আরবাআ রাক‘আতি সালাতিল এশা। ফারদুল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "এশার দুই রাকাত সুন্নাত নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِ العِشَاءِ سُنَّةُ رَسُولِ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিল এশা। সুন্নাতু রাছুলিল্লাহি তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "এশার দুই রাকাত নফল নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى رَكْعَتَىْ صَلَوةِالْنَفْلِ مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation": "নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা রাকাতাই সালাতিন নফলে। মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                },
                {
                    "subtitle": "এশার তিন রাকাত বিতর নামাজের নিয়ত",
                    "arabic": "نَوَيْتُ اَنْ اُصَلِّىَ لِلَّهِ تَعَا لَى  ثَلَاثَ رَكْعَتِ صَلَوةِ الوِتْرِ وَاجِبُ اللَّهِ تَعَا لَى مُتَوَجِّهًا اِلَى جِهَةِ الْكَعْبَةِ الشَّرِ يْفَةِ اَللَّهُ اَكْبَرُ",
                    "pronunciation":"নাওয়াইতু আন উসাল্লিয়া-লিল্লাহি তা’আলা সালাসা রাক‘আতি সালাতিল ইতরি। ওয়াজিবুল্লাহি  তা’আলা মুতাওয়াজ্জিহান ইলা জিহাতিল কা‘বাতিশ্ শরীফাতি আল্লাহু আকবার।"
                }
            ]
        }
    ]
]